---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LandingTwoManyLoops
source: html/f00719bb-aa7e-8085-b596-f22a1f913c07.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LandingTwoManyLoops Property

Sketch landing can only have one closed loop

## Syntax (C#)
```csharp
public static FailureDefinitionId LandingTwoManyLoops { get; }
```